Revit 2025 API
FindReferenceTarget Enumeration
 The type of reference to find from a ReferenceIntersector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FindReferenceTarget
Public Enumeration FindReferenceTarget
public enum class FindReferenceTarget
type FindReferenceTarget
Members
Member name | Value | Description
Element | 1 |  An element.
Mesh | 2 |  A mesh.
Edge | 4 |  An edge.
Curve | 8 |  A curve.
Face | 16 |  A face.
All | 31 |  All target types.
See Also
Reference
Autodesk.Revit.DB Namespace